#Использовать ".."
#Использовать asserts

Перем Токен;

Процедура ПередЗапускомТеста() Экспорт

	ИмяФайла = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "token.txt");
	Файл = Новый Файл(ИмяФайла);
	Если Не Файл.Существует() Тогда
		ВызватьИсключение("Не найден файл с токеном. Файл должен находится по пути ./fixtures/token.txt");
	КонецЕсли;

	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(ИмяФайла);
	Токен = ТекстовыйДокумент.ПолучитьТекст();
	
	ТекстовыйДокумент = Неопределено;

КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры

&Тест
Процедура Тест_ПроверкаПолученияПользователя() Экспорт

	Клиент = Новый КлиентGitHub();
	Клиент.ИспользоватьТокен(Токен);

	ИмяПользователя = "otymko";

	Пользователь = Клиент.ПолучитьПользователя(ИмяПользователя);
	Ожидаем.Что(Пользователь, "Пользователь guthib получен по имени").Заполнено();

	Пользователь = Клиент.ПолучитьПользователя(Новый ПользовательGitHub(ИмяПользователя));
	Ожидаем.Что(Пользователь, "Пользователь guthib получен по объекту").Заполнено();
	Ожидаем.Что(Пользователь.Логин, "Имя пользователя github совпадает с полученным").Равно(ИмяПользователя);

КонецПроцедуры

Токен = "";